ltsochev-dev/esp32-weather-station/lib/OpenWeather/OpenWeather.cpp
  parser.reset();

  client.stop();
  
  // A message has been parsed without error but the data-point correctness is unknown
  return parseOK;
}

bool OW_Weather::parseRequestInsecure(String* url) {

  uint32_t dt = millis();

  const char*  host = "api.openweathermap.org";

  // AXTLS used (insecure)
  WiFiClient client;
  port = 80;
 
  if (!client.connect(host, port))
  {
    OW_STATUS_PRINTF("Connection failed.\n");
    return false;
  }
  JSON_Decoder parser;
  parser.setListener(this);

  uint32_t timeout = millis();
  char c = 0;
  parseOK = false;

  #ifdef SHOW_JSON
  int ccount = 0;
  #endif

  OW_STATUS_PRINTF("\nThe connection to server is INSECURE (using AXTLS).\n");

  // Send GET request
  OW_STATUS_PRINTF("Sending GET request to api.openweathermap.org...\n");
  client.print(String("GET ") + *url + " HTTP/1.1\r\n" + "Host: " + host + "\r\n" + "Connection: close\r\n\r\n");

  // Pull out any header, X-Forecast-API-Calls: reports current daily API call count
  while (client.available() || client.connected())
  {
    String line = client.readStringUntil('\n');
    if (line == "\r") {
      OW_STATUS_PRINTF("Header end found\n");
      break;
    }

    OW_STATUS_PRINT(line); OW_STATUS_PRINTF("\n");

    if ((millis() - timeout) > 5000UL)
    {
      OW_STATUS_PRINTF("HTTP header timeout\n");
      client.stop();
      return false;
    }
  }


  // Parse the JSON data, available() includes yields
  while (client.available() || client.connected())
  {
    while (client.available())
    {
      c = client.read();
      parser.parse(c);
  #ifdef SHOW_JSON
      if (c == '{' || c == '[' || c == '}' || c == ']') Serial.println();
      Serial.print(c); if (ccount++ > 100 && c == ',') {ccount = 0; Serial.println();}
  #endif
    }

    if ((millis() - timeout) > 8000UL)
    {
      OW_STATUS_PRINTF("JSON client timeout\n");
      parser.reset();
      client.stop();
      return false;
    }
  }

  OW_STATUS_PRINTF("\nDone in "); OW_STATUS_PRINT(millis()-dt); OW_STATUS_PRINTF(" ms\n");

  parser.reset();

  client.stop();
  
  // A message has been parsed without error but the data-point correctness is unknown
  return parseOK;
}

#endif // ESP32 or ESP8266 parseRequest


/***************************************************************************************
** Function name:           key etc
** Description:             These functions are called while parsing the JSON message
***************************************************************************************/
void OW_Weather::key(const char *key) {

  currentKey = key;

#ifdef SHOW_CALLBACK
  Serial.print("\n>>> Key >>>" + (String)key);
#endif
}

void OW_Weather::startDocument() {

  currentParent = currentKey =   currentSet = "";
  objectLevel = 0;
  valuePath = "";
  arrayIndex = 0;
  arrayLevel = 0;
  parseOK = true;

#ifdef SHOW_CALLBACK
  Serial.print("\n>>> Start document >>>");
#endif
}

void OW_Weather::endDocument() {

  currentParent = currentKey = "";
  objectLevel = 0;
  valuePath = "";
  arrayIndex = 0;
  arrayLevel = 0;

#ifdef SHOW_CALLBACK
  Serial.print("\n<<< End document <<<");
#endif
}

void OW_Weather::startObject() {

  if (arrayIndex == 0 && objectLevel == 1) currentParent = currentKey;
  currentSet = currentKey;
  objectLevel++;

#ifdef SHOW_CALLBACK
  Serial.print("\n>>> Start object level:" + (String) objectLevel + " array level:" + (String) arrayLevel + " array index:" + (String) arrayIndex +" >>>");
#endif
}

void OW_Weather::endObject() {

  if (arrayLevel == 0) currentParent = "";
  if (arrayLevel == 1  && objectLevel == 2) arrayIndex++;
  objectLevel--;
  

#ifdef SHOW_CALLBACK
  Serial.print("\n<<< End object <<<");
#endif
}

void OW_Weather::startArray() {

  arrayLevel++;
  valuePath = currentParent + "/" + currentKey; // aka = current Object, e.g. "daily:data"

#ifdef SHOW_CALLBACK
  Serial.print("\n>>> Start array " + valuePath + "/" + (String) arrayLevel + "/" + (String) arrayIndex +" >>>");
#endif
}

void OW_Weather::endArray() {
  if (arrayLevel > 0) arrayLevel--;
  if (arrayLevel == 0) arrayIndex = 0;
  valuePath = "";

#ifdef SHOW_CALLBACK
  Serial.print("\n<<< End array <<<");
#endif
}

void OW_Weather::whitespace(char c) {
  c = c; // Avoid warning
}

void OW_Weather::error( const char *message ) {
  Serial.print("\nParse error message: ");
  Serial.print(message);
  parseOK = false;
}

/***************************************************************************************
** Function name:           value (full or partial data set)
** Description:             Stores the parsed data in the structures for sketch access
***************************************************************************************/
void OW_Weather::value(const char *val)
{
    if (freeSet) freeDataSet(val);
    else if (fullSet) fullDataSet(val);
    else partialDataSet(val);
}

/***************************************************************************************
** Function name:           fullDataSet
** Description:             Collects full data set
***************************************************************************************/
void OW_Weather::fullDataSet(const char *val) {

   String value = val;

  // Start of JSON
  if (currentParent == "") {
    if (currentKey == "lat") lat = value.toFloat();
    if (currentKey == "lon") lon = value.toFloat();
    if (currentKey == "timezone") timezone = value;
  }

  // Current forecast - no array index - short path
  if (currentParent == "current") {
    data_set = "current";
    if (currentKey == "dt") current->dt = (uint32_t)value.toInt();
    else
    if (currentKey == "sunrise") current->sunrise = (uint32_t)value.toInt();
    else
    if (currentKey == "sunset") current->sunset = (uint32_t)value.toInt();
    else
    if (currentKey == "temp") current->temp = value.toFloat();
    else
    if (currentKey == "feels_like") current->feels_like = value.toFloat();
    else
    if (currentKey == "pressure") current->pressure = value.toFloat();
    else
    if (currentKey == "humidity") current->humidity = value.toInt();
    else
    if (currentKey == "dew_point") current->dew_point = value.toFloat();
    else
    if (currentKey == "uvi") current->uvi = value.toFloat();
    else
    if (currentKey == "clouds") current->clouds = value.toInt();
    else
    if (currentKey == "visibility") current->visibility = value.toInt();
    else
    if (currentKey == "wind_speed") current->wind_speed = value.toFloat();
    else
    if (currentKey == "wind_gust") current->wind_gust = value.toFloat();
    else
    if (currentKey == "wind_deg") current->wind_deg = (uint16_t)value.toInt();
    else
    if (currentKey == "rain") current->rain = value.toFloat();
    else
    if (currentKey == "snow") current->snow = value.toFloat();
    else

    if (currentKey == "id") current->id = value.toInt();
    else
    if (currentKey == "main") current->main = value;
    else
    if (currentKey == "description") current->description = value;
    else
    if (currentKey == "icon") current->icon = value;

    return;
  }

  // Hourly forecast
  if (currentParent == "hourly") {
    data_set = "hourly";
    
    if (arrayIndex >= MAX_HOURS) return;
    
    if (currentKey == "dt") hourly->dt[arrayIndex] = (uint32_t)value.toInt();
    else
    if (currentKey == "temp") hourly->temp[arrayIndex] = value.toFloat();
    else
    if (currentKey == "feels_like") hourly->feels_like[arrayIndex] = value.toFloat();
    else
    if (currentKey == "pressure") hourly->pressure[arrayIndex] = value.toFloat();
    else
    if (currentKey == "humidity") hourly->humidity[arrayIndex] = value.toInt();
    else
    if (currentKey == "dew_point") hourly->dew_point[arrayIndex] = value.toFloat();
    else
    if (currentKey == "clouds") hourly->clouds[arrayIndex] = value.toInt();
    else
    if (currentKey == "wind_speed") hourly->wind_speed[arrayIndex] = value.toFloat();
    else
    if (currentKey == "wind_gust") hourly->wind_gust[arrayIndex] = value.toFloat();
    else
    if (currentKey == "wind_deg") hourly->wind_deg[arrayIndex] = (uint16_t)value.toInt();
    else
    if (currentKey == "rain") hourly->rain[arrayIndex] = value.toFloat();
    else
    if (currentKey == "snow") hourly->snow[arrayIndex] = value.toFloat();
    else

    if (currentKey == "id") hourly->id[arrayIndex] = value.toInt();
    else
    if (currentKey == "main") hourly->main[arrayIndex] = value;
    else
    if (currentKey == "description") hourly->description[arrayIndex] = value;
    else
    if (currentKey == "icon") hourly->icon[arrayIndex] = value;
    else
    if (currentKey == "pop") hourly->pop[arrayIndex] = value.toFloat();

    return;
  }


