ltsochev-dev/esp32-weather-station/lib/OpenWeather/OpenWeather.cpp
  // Daily forecast
  if (currentParent == "daily") {
    data_set = "daily";
    
    if (arrayIndex >= MAX_DAYS) return;
    
    if (currentKey == "dt") daily->dt[arrayIndex] = (uint32_t)value.toInt();
    else
    if (currentKey == "sunrise") daily->sunrise[arrayIndex] = (uint32_t)value.toInt();
    else
    if (currentKey == "sunset") daily->sunset[arrayIndex] = (uint32_t)value.toInt();
    else
    if (currentKey == "pressure") daily->pressure[arrayIndex] = value.toFloat();
    else
    if (currentKey == "humidity") daily->humidity[arrayIndex] = value.toInt();
    else
    if (currentKey == "dew_point") daily->dew_point[arrayIndex] = value.toFloat();
    else
    if (currentKey == "clouds") daily->clouds[arrayIndex] = value.toInt();
    else
    if (currentKey == "wind_speed") daily->wind_speed[arrayIndex] = value.toFloat();
    else
    if (currentKey == "wind_gust") daily->wind_gust[arrayIndex] = value.toFloat();
    else
    if (currentKey == "wind_deg") daily->wind_deg[arrayIndex] = (uint16_t)value.toInt();
    else
    if (currentKey == "rain") daily->rain[arrayIndex] = value.toFloat();
    else
    if (currentKey == "snow") daily->snow[arrayIndex] = value.toFloat();
    else

    if (currentKey == "id") daily->id[arrayIndex] = value.toInt();
    else
    if (currentKey == "main") daily->main[arrayIndex] = value;
    else
    if (currentKey == "description") daily->description[arrayIndex] = value;
    else
    if (currentKey == "icon") daily->icon[arrayIndex] = value;
    else
    if (currentKey == "pop") daily->pop[arrayIndex] = value.toFloat();

    if (currentSet == "temp") {
      if (currentKey == "morn") daily->temp_morn[arrayIndex] = value.toFloat();
      else
      if (currentKey == "day") daily->temp_day[arrayIndex] = value.toFloat();
      else
      if (currentKey == "eve") daily->temp_eve[arrayIndex] = value.toFloat();
      else
      if (currentKey == "night") daily->temp_night[arrayIndex] = value.toFloat();
      else
      if (currentKey == "min") daily->temp_min[arrayIndex] = value.toFloat();
      else
      if (currentKey == "max") daily->temp_max[arrayIndex] = value.toFloat();
    }

    if (currentSet == "feels_like") {
      if (currentKey == "morn") daily->feels_like_morn[arrayIndex] = value.toFloat();
      else
      if (currentKey == "day") daily->feels_like_day[arrayIndex] = value.toFloat();
      else
      if (currentKey == "eve") daily->feels_like_eve[arrayIndex] = value.toFloat();
      else
      if (currentKey == "night") daily->feels_like_night[arrayIndex] = value.toFloat();
    }

    return;
  }
}


/***************************************************************************************
** Function name:           freeDataSet
** Description:             Collects full data set
***************************************************************************************/
void OW_Weather::freeDataSet(const char *val) {
  String value = val;

  // Start of JSON
  if (currentParent == "") {
    data_set = "";
    if (currentKey == "visibility") current->visibility = value.toInt();
    else
    if (currentKey == "dt") current->dt = (uint32_t)value.toInt();
    else
    if (currentKey == "timezone") timezone = value;
    else
    if (currentKey == "id") current->id = value.toInt();

    return;
  }

  if (currentParent == "coord") {
    if (currentKey == "lat") lat = value.toFloat();
    else
    if (currentKey == "lon") lon = value.toFloat();

    return;
  }

  if (currentParent == "main") {
    data_set = "main";
    if (currentKey == "temp") current->temp = value.toFloat();
    else
    if (currentKey == "humidity") current->humidity = value.toInt();
    else
    if (currentKey == "feels_like") current->feels_like = value.toFloat();
    else
    if (currentKey == "pressure") current->pressure = value.toFloat();

    return;
  }

  if (currentParent == "sys") {
    data_set = "sys";
    if (currentKey == "sunrise") current->sunrise = (uint32_t)value.toInt();
    else
    if (currentKey == "sunset") current->sunset = (uint32_t)value.toInt();

    return;
  }

  if (currentParent == "clouds") {
    if (currentKey == "all") current->clouds = value.toInt();

    return;
  }

  if (currentParent == "wind") {
    data_set = "wind";
    if (currentKey == "speed") current->wind_speed = value.toFloat();
    else
    if (currentKey == "deg") current->wind_deg = value.toInt();
    else
    if (currentKey == "gust") current->wind_gust = value.toFloat();

    return;
  }

  if (currentParent == "rain") {
    if (currentKey == "1h") current->rain = value.toFloat();

    return;
  }

  if (currentParent == "snow") {
    if (currentKey == "1h") current->snow = value.toFloat();

    return;
  }

  if (currentParent == "weather") {
    if (currentKey == "id") current->id = value.toInt();
    else
    if (currentKey == "main") current->main = value;
    else
    if (currentKey == "description") current->description = value;
    else
    if (currentKey == "icon") current->icon = value;

    return;
  }
}

/***************************************************************************************
** Function name:           partialDataSet
** Description:             Collects partial data set
***************************************************************************************/
void OW_Weather::partialDataSet(const char *val) {

   String value = val;

  // Current forecast - no array index - short path
  if (currentParent == "current") {
    data_set = "current";
    if (currentKey == "dt") current->dt = (uint32_t)value.toInt();
    else
    if (currentKey == "sunrise") current->sunrise = (uint32_t)value.toInt();
    else
    if (currentKey == "sunset") current->sunset = (uint32_t)value.toInt();
    else
    if (currentKey == "temp") current->temp = value.toFloat();
    //else
    //if (currentKey == "feels_like") current->feels_like = value.toFloat();
    else
    if (currentKey == "pressure") current->pressure = value.toFloat();
    else
    if (currentKey == "humidity") current->humidity = value.toInt();
    //else
    //if (currentKey == "dew_point") current->dew_point = value.toFloat();
    //else
    //if (currentKey == "uvi") current->uvi = value.toFloat();
    else
    if (currentKey == "clouds") current->clouds = value.toInt();
    //else
    //if (currentKey == "visibility") current->visibility = value.toInt();
    else
    if (currentKey == "wind_speed") current->wind_speed = value.toFloat();
    //else
    //if (currentKey == "wind_gust") current->wind_gust = value.toFloat();
    else
    if (currentKey == "wind_deg") current->wind_deg = (uint16_t)value.toInt();
    //else
    //if (currentKey == "rain") current->rain = value.toFloat();
    //else
    //if (currentKey == "snow") current->snow = value.toFloat();

    else
    if (currentKey == "id") current->id = value.toInt();
    else
    if (currentKey == "main") current->main = value;
    else
    if (currentKey == "description") current->description = value;
    //else
    //if (currentKey == "icon") current->icon = value;

    return;
  }

