ltsochev-dev/esp32-weather-station/lib/OpenWeather/OpenWeather.cpp
/*
  // Hourly forecast
  if (currentParent == "hourly") {
    data_set = "hourly";
    
    if (arrayIndex >= MAX_HOURS) return;
    
    if (currentKey == "dt") hourly->dt[arrayIndex] = (uint32_t)value.toInt();
    else
    if (currentKey == "temp") hourly->temp[arrayIndex] = value.toFloat();
    else
    if (currentKey == "feels_like") hourly->feels_like[arrayIndex] = value.toFloat();
    else
    if (currentKey == "pressure") hourly->pressure[arrayIndex] = value.toFloat();
    else
    if (currentKey == "humidity") hourly->humidity[arrayIndex] = value.toInt();
    else
    if (currentKey == "dew_point") hourly->dew_point[arrayIndex] = value.toFloat();
    else
    if (currentKey == "clouds") hourly->clouds[arrayIndex] = value.toInt();
    else
    if (currentKey == "wind_speed") hourly->wind_speed[arrayIndex] = value.toFloat();
    else
    if (currentKey == "wind_gust") hourly->wind_gust[arrayIndex] = value.toFloat();
    else
    if (currentKey == "wind_deg") hourly->wind_deg[arrayIndex] = (uint16_t)value.toInt();
    else
    if (currentKey == "rain") hourly->rain[arrayIndex] = value.toFloat();
    else
    if (currentKey == "snow") hourly->snow[arrayIndex] = value.toFloat();
    else

    if (currentKey == "id") hourly->id[arrayIndex] = value.toInt();
    else
    if (currentKey == "main") hourly->main[arrayIndex] = value;
    else
    if (currentKey == "description") hourly->description[arrayIndex] = value;
    else
    if (currentKey == "icon") hourly->icon[arrayIndex] = value;

    return;
  }
*/

  // Daily forecast
  if (currentParent == "daily") {
    data_set = "daily";
    
    if (arrayIndex >= MAX_DAYS) return;
    
    if (currentKey == "dt") daily->dt[arrayIndex] = (uint32_t)value.toInt();
    else
    //if (currentKey == "sunrise") daily->sunrise[arrayIndex] = (uint32_t)value.toInt();
    //else
    //if (currentKey == "sunset") daily->sunset[arrayIndex] = (uint32_t)value.toInt();
    //else
    //if (currentKey == "pressure") daily->pressure[arrayIndex] = value.toFloat();
    //else
    //if (currentKey == "humidity") daily->humidity[arrayIndex] = value.toInt();
    //else
    //if (currentKey == "dew_point") daily->dew_point[arrayIndex] = value.toFloat();
    //else
    //if (currentKey == "clouds") daily->clouds[arrayIndex] = value.toInt();
    //else
    //if (currentKey == "wind_speed") daily->wind_speed[arrayIndex] = value.toFloat();
    //else
    //if (currentKey == "wind_gust") daily->wind_gust[arrayIndex] = value.toFloat();
    //else
    //if (currentKey == "wind_deg") daily->wind_deg[arrayIndex] = (uint16_t)value.toInt();
    //else
    //if (currentKey == "rain") daily->rain[arrayIndex] = value.toFloat();
    //else
    //if (currentKey == "snow") daily->snow[arrayIndex] = value.toFloat();
    //else

    if (currentKey == "id") daily->id[arrayIndex] = value.toInt();
    //else
    //if (currentKey == "main") daily->main[arrayIndex] = value;
    //else
    //if (currentKey == "description") daily->description[arrayIndex] = value;
    //else
    //if (currentKey == "icon") daily->icon[arrayIndex] = value;

    if (currentSet == "temp") {
      //if (currentKey == "morn") daily->temp_morn[arrayIndex] = value.toFloat();
      //else
      //if (currentKey == "day") daily->temp_day[arrayIndex] = value.toFloat();
      //else
      //if (currentKey == "eve") daily->temp_eve[arrayIndex] = value.toFloat();
      //else
      //if (currentKey == "night") daily->temp_night[arrayIndex] = value.toFloat();
      //else
      if (currentKey == "min") daily->temp_min[arrayIndex] = value.toFloat();
      else
      if (currentKey == "max") daily->temp_max[arrayIndex] = value.toFloat();
    }

    //if (currentSet == "feels_like") {
      //if (currentKey == "morn") daily->feels_like_morn[arrayIndex] = value.toFloat();
      //else
      //if (currentKey == "day") daily->feels_like_day[arrayIndex] = value.toFloat();
      //else
      //if (currentKey == "eve") daily->feels_like_eve[arrayIndex] = value.toFloat();
      //else
      //if (currentKey == "night") daily->feels_like_night[arrayIndex] = value.toFloat();
    //}

    return;
  }

}
